Revit 2026 API
CurveByPointsUtils Class
 A static class that contains methods for processing curves driven by points.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveByPointsUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class CurveByPointsUtils : IDisposable
Public Class CurveByPointsUtils
	Implements IDisposable
public ref class CurveByPointsUtils : IDisposable
type CurveByPointsUtils =
    class
        interface IDisposable
    end
The CurveByPointsUtils type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddCurvesToFaceRegion
CreateArcThroughPoints |  Creates an arc through the given reference points.
CreateRectangle
Dispose | Releases all resources used by the CurveByPointsUtils
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFaceRegions |  Gets the FaceRegions in the existing face.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetHostFace |  Gets the host face to which the CurveElement is added.
GetProjectionType |  Gets the projection type of the CurveElement.
GetSketchOnSurface |  Gets the relationship between the CurveElement and face.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetProjectionType |  Sets the projection type of the CurveElement.
SetSketchOnSurface |  Sets the relationship between the CurveElement and face.
ToString | Returns a string that represents the current object.
(Inherited from Object)
ValidateCurveElementIdArrayForFaceRegions
Top
See Also
Reference
Autodesk.Revit.DB Namespace